src/DataProcessors/СписаниеЗависшихРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СписаниеЗависшихРезервов</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Резервы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбрать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КорректировкаЗаявкиПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЛиквидности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЛиквидности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDSite</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоставки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВРезерве</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВСборке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейРезерва</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БлокировкаКонтрагента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СохраненныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СохраненныеНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СохраненнаяНастройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОтказыПоЗаявкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ОтказыПоЗаявкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСтрокДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/DataProcessors/СписаниеЗависшихРезервов/Ext/ManagerModule.bsl
Процедура ВыполнитьАвтоЗакрытие() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СохраненныеНастройки.СохраненнаяНастройка
		|ИЗ
		|	РегистрСведений.СохраненныеНастройки КАК СохраненныеНастройки
		|ГДЕ
		|	СохраненныеНастройки.ИмяОбъекта = &ИмяОбъекта";
	
	Запрос.УстановитьПараметр("ИмяОбъекта", "ОбработкаСписаниеЗависшихРезервов");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВыполнитьЗакрытиеПоНастройке(Выборка.СохраненнаяНастройка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьЗакрытиеПоНастройке(СохраненнаяНастройка) Экспорт
	
	СтруктураНастройки = СохраненнаяНастройка.Получить();
	
	Если НЕ ИспользоватьАвтомат(СтруктураНастройки.КомпоновщикНастроекПользовательскиеНастройки) Тогда
		Возврат;
	КонецЕсли;
		
	СхемаКомпоновкиДанных = Обработки.СписаниеЗависшихРезервов.ПолучитьМакет("МакетКомпоновки");
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных); 
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(СтруктураНастройки.КомпоновщикНастроекПользовательскиеНастройки);
	/////////	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений") , Ложь, );
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновкиДанных);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	ТаблицаРезультата = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	//Объект.Резервы.Загрузить(ТаблицаРезультата);
	
	ТаблицаЗаявок = ТаблицаРезультата.Скопировать(,"Заявка");
	ТаблицаЗаявок.Свернуть("Заявка");
	
	Для каждого СтрокаТЗ Из ТаблицаЗаявок Цикл
		Обработки.СписаниеЗависшихРезервов.ЗакрытьРезервПоЗаявке(СтрокаТЗ.Заявка, ТаблицаРезультата.Скопировать(Новый структура("Заявка", СтрокаТЗ.Заявка), "СтрокаЗаявки, ВРезерве"));
	КонецЦикла;
	

КонецПроцедуры

Функция ИспользоватьАвтомат(Знач вхПользовательскиеНастройки) Экспорт
	
	Автоматически = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(вхПользовательскиеНастройки, "Автоматически");
	
	Если Автоматически = Неопределено Тогда
		Возврат Ложь;
	Иначе 
		Возврат Автоматически.Значение И Автоматически.Использование;
	КонецЕсли;
	
КонецФункции

Процедура ЗакрытьРезервПоЗаявке(Заявка, СтрокиЗаявки) Экспорт
	
	Документ = Документы.ЗаявкаПокупателя.ПолучитьПоследнийДокументКорректировки(Заявка); 
	//Документ = ОбщегоНазначения.ПолучитьПоследнююКорректировкуЗаявки(Заявка);
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаЗаявкиПокупателя") Тогда
		ИзменяемыйОбъект = Документ.Скопировать();
		ИзменяемыйОбъект.Дата = ТекущаяДата();
	Иначе
		ИзменяемыйОбъект = Документ.ПолучитьОбъект();
		ИзменяемыйОбъект.ДополнительныеСвойства.Свойство("СоздаватьКорректировку", Истина);
	КонецЕсли;
	
	ДобавленыОтказы = Ложь; 
	
	Для каждого СтрокаЗявки Из СтрокиЗаявки Цикл
		
		СтрокаДокумента = ИзменяемыйОбъект.Товары.Найти(СтрокаЗявки.СтрокаЗаявки, "СтрокаЗаявки");
		
		Если СтрокаДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КлючСвязи = СтрокаДокумента.КлючСвязи;
		КоличествоИсходное = СтрокаДокумента.Количество;
		КоличествоОтказ = ОтказыПоСтрокеЗаявки(СтрокаДокумента.СтрокаЗаявки);
		
		ДоступноКОтказу = КоличествоИсходное - КоличествоОтказ;
		
		Отказать = Мин(ДоступноКОтказу, СтрокаЗявки.ВРезерве);
		ПричинаОтмены = Справочники.СостоянияСтрокДокументов.ПревышенСрокРезерва;
		Если Отказать > 0 Тогда 
			
			СтрокиОтказов = ИзменяемыйОбъект.ПричиныОтказов.НайтиСтроки(Новый Структура("КлючСвязи, ПричинаОтмены", КлючСвязи, ПричинаОтмены));
			Если СтрокиОтказов.Количество() = 0 Тогда
				Строка = ИзменяемыйОбъект.ПричиныОтказов.Добавить();
			Иначе
				Строка = СтрокиОтказов[0];
			КонецЕсли;
			
			Строка.КлючСвязи = КлючСвязи;
			Строка.ПричинаОтмены = ПричинаОтмены;
			Строка.Количество = Строка.Количество + Отказать;
			
			ДобавленыОтказы = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДобавленыОтказы Тогда
		Попытка
			ИзменяемыйОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		Исключение
			Сообщить("Не удалось отменить строки заявки, Контрагент: "+Заявка.Контрагент+", Заявка: "+Заявка+", ошибка: "+ОписаниеОшибки());
			СтрокиТекст = "Строки:";
			Для каждого СтрокаЗявки Из СтрокиЗаявки Цикл
				СтрокиТекст = СтрокиТекст + СтрокаЗявки + Символы.ПС;	
			КонецЦикла;
			Сообщить(СтрокиТекст);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Функция ОтказыПоСтрокеЗаявки(СтрокаЗаявки) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОтказыПоЗаявкамОбороты.КоличествоОборот КАК Отказы
	                      |ИЗ
	                      |	РегистрНакопления.ОтказыПоЗаявкам.Обороты(, , , СтрокаЗаявки = &СтрокаЗаявки) КАК ОтказыПоЗаявкамОбороты");
	Запрос.УстановитьПараметр("СтрокаЗаявки", СтрокаЗаявки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Отказы, 0);
	
КонецФункции
